Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཕྱི་མའི་མཐའ་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་གཟུགས་སོ།
en: If you ask why, Subhūti, the inherent existence of their future limits, though without entity, is still physical forms.

source: །རབ་འབྱོར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཕྱི་མའི་མཐའ་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Subhūti, the future limits of feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཕྱི་མའི་མཐའ་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་རྣམ་པར་ཤེས་པའོ།
en: If you ask why, Subhūti, the inherent existence of their future limits, though without entity, is still consciousness [and so forth]. {

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱི་མའི་མཐའ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Ki.II-III: 155} Subhūti, the future limits [of all other phenomena, attributes, and attainments], up to and including all-aspect omniscience, are neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཕྱི་མའི་མཐའ་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: If you ask why, Subhūti, the inherent existence of their future limits, though without entity, is still all-aspect omniscience [and so forth]. “

source: །རབ་འབྱོར་གཟུགས་ཀྱི་ད་ལྟར་བྱུང་བ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Moreover, Subhūti, the present state of physical forms is neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ད་ལྟར་བྱུང་བ་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་གཟུགས་སོ།
en: If you ask why, Subhūti, the inherent existence of their present state, though without entity, is still physical forms.

source: །རབ་འབྱོར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་ད་ལྟར་བྱུང་བ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Subhūti, the present states of feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ད་ལྟར་བྱུང་བ་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་རྣམ་པར་ཤེས་པའོ།
en: If you ask why, Subhūti, the inherent existence of their present states, though without entity, is still consciousness [and so forth].

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ད་ལྟར་བྱུང་བ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Subhūti, the present states [of all other phenomena, attributes, and attainments], up to and including all-aspect omniscience, are neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ད་ལྟར་བྱུང་བའི་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: If you ask why, Subhūti, the inherent existence of their present states, though without entity, is still all-aspect omniscience [and so forth].” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བརྩོན་འགྲུས་ཆུང་བ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ། སྡིག་པའི་གྲོགས་པོའི་སུག་པར་ལྷུང་པ། བདུད་ཀྱི་དབང་དུ་གྱུར་བ་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་བཏང་བ། དྲན་པ་ཉམས་པ། ཤེས་བཞིན་དང་མི་ལྡན་པ་རྣམས་ཀྱིས་མོས་པར་དཀའོ།
en: Blessed Lord, it is difficult for those who do not persevere, who have not cultivated the roots of virtuous action, who have fallen into the clutches of evil associates, who are under the sway of māras, who are indolent, feeble in perseverance, and forgetful, and who are without alertness to believe in the perfection of wisdom.” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ཏེ།
en: Subhūti, so it is!” replied the Blessed One. “

source: རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བརྩོན་འགྲུས་ཆུང་པ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ། སྡིག་པའི་གྲོགས་པོའི་ལག་དུ་ལྷུང་བ། བདུད་ཀྱི་དབང་དུ་གྱུར་པ་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་བཏང་པ། དྲན་པ་ཉམས་པ། ཤེས་བཞིན་དང་མི་ལྡན་པ་རྣམས་ཀྱིས་མོས་པར་དཀའོ།
en: Subhūti, it is difficult for those who do not persevere, who have not cultivated the roots of virtuous action, who have fallen into the clutches of evil associates, who are under the sway of māras, who are indolent, feeble in perseverance, and forgetful, and who are without alertness to believe in the perfection of wisdom. “

source: །རབ་འབྱོར་གཞན་ཡང་གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: Moreover, Subhūti, the purity of physical forms is the purity of fruition.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of feelings, perceptions, formative predispositions, and consciousness is the purity of fruition.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the sense fields, sensory elements, and links of dependent origination is the purity of fruition.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the perfection of generosity is the purity of fruition.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom is the purity of fruition.

source: །ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the emptiness of internal phenomena is the purity of fruition.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, is the purity of fruition.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the thirty-seven factors conducive to enlightenment is the purity of fruition.

source: འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions is the purity of fruition.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: The purity of the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers is the purity of fruition.

source: མངོན་པར་ཤེས་པ་རྣམས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the meditative stabilities and the dhāraṇī gateways is the purity of fruition.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas is the purity of fruition.

source: ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: The purity of knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience is the purity of fruition. “

source: །རབ་འབྱོར་གཞན་ཡང་གཟུགས་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ།
en: Moreover, Subhūti, the purity of physical forms is the purity of the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་ཡོངས་སུ་དག་པ་སྟེ།
en: The purity of the perfection of wisdom is the purity of physical forms. {Ki.

source: དེ་ལྟར་ན་གཟུགས་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: II-III: 156} So it is that the purity of physical forms and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ།
en: The purity of feelings, perceptions, formative predispositions, and consciousness is the purity of the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པ་སྟེ།
en: The purity of the perfection of wisdom is the purity of consciousness [and so forth].

source: དེ་ལྟར་ན་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of consciousness [and so forth] and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ།
en: The purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience, is the purity of the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་སྟེ།
en: The purity of the perfection of wisdom is the purity of all-aspect omniscience [and so forth].

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience [and so forth] and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་བདག་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། གཟུགས་རྣམ་པར་དག་པ།
en: Moreover, Subhūti, the purity of the self is the purity of physical forms.

source: གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། བདག་རྣམ་པར་དག་པ་སྟེ།
en: The purity of physical forms is the purity of the self.

source: དེ་ལྟར་ན་བདག་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the self and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །བདག་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: The purity of the self is the purity of feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། བདག་རྣམ་པར་དག་པ་སྟེ།
en: The purity of consciousness [and so forth] is the purity of the self.

source: དེ་ལྟར་ན་བདག་རྣམ་པར་དག་པ་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the self and this purity of consciousness [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །བདག་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ།
en: The purity of the self is the purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། བདག་རྣམ་པར་དག་པ་སྟེ།
en: The purity of all-aspect omniscience [and so forth] is the purity of the self.

source: དེ་ལྟར་ན་བདག་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །སེམས་ཅན་དང་། སྲོག་དང་གསོ་བ་དང་།
en: So it is that the purity of the self and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: སྐྱེས་བུ་དང་གང་ཟག་དང་། ཤེད་ཅན་དང་ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི།
en: The purity of sentient beings, life forms, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, and viewers is the purity of physical forms.

source: གཟུགས་རྣམ་པར་དག་པ། གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི།
en: The purity of physical forms is the purity of viewers [and so forth].

source: མཐོང་བ་པོ་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་མཐོང་བ་པོ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of viewers [and so forth] and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །སེམས་ཅན་དང་། མཐོང་བ་པོའི་བར་དུ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་།
en: The purity of beings [and so forth], up to and including viewers, is the purity of feelings, perceptions, formative predispositions and consciousness.

source: རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། མཐོང་བ་པོ་རྣམ་པར་དག་པ་སྟེ།
en: The purity of consciousness [and so forth] is the purity of viewers [and so forth].

source: དེ་ལྟར་ན་མཐོང་བ་པོ་རྣམ་པར་དག་པ་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of viewers [and so forth] and this purity of consciousness [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །སེམས་ཅན་དང་མཐོང་བ་པོའི་བར་དུ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ།
en: The purity of beings [and so forth], up to and including viewers, is the purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི། མཐོང་བ་པོ་རྣམ་པར་དག་པ་སྟེ།
en: The purity of all-aspect omniscience [and so forth] is the purity of viewers [and so forth].

source: དེ་ལྟར་ན་མཐོང་བ་པོ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of viewers [and so forth] and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་བདག་ཡོངས་སུ་དག་པས། གཟུགས་ཡོངས་སུ་དག་པ། གཟུགས་ཡོངས་སུ་དག་པས། བདག་ཡོངས་སུ་དག་པ་སྟེ།
en: Moreover, Subhūti, physical forms are pure owing to the purity of the self, and the self is pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་བདག་ཡོངས་སུ་དག་པ་དང་། གཟུགས་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the self and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །བདག་ཡོངས་སུ་དག་པས་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པ། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པས་བདག་ཡོངས་སུ་དག་པ་སྟེ། དེ་ལྟར་ན་བདག་ཡོངས་སུ་དག་པ་དང་།
en: Feelings, perceptions, formative predispositions, and consciousness are pure owing to the purity of the self, and the self is pure owing to the purity of consciousness [and so forth].

source: རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །བདག་ཡོངས་སུ་དག་པས།
en: So it is that the purity of the self and this purity of consciousness [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of the self, and the self is pure owing to the purity of all-aspect omniscience [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པས། བདག་ཡོངས་སུ་དག་པ་སྟེ། དེ་ལྟར་ན་བདག་ཡོངས་སུ་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the self and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སེམས་ཅན་དང་། མཐོང་བ་པོའི་བར་དུ་ཡོངས་སུ་དག་པས། གཟུགས་ཡོངས་སུ་དག་པ། གཟུགས་ཡོངས་སུ་དག་པས། མཐོང་བ་པོའི་བར་དུ་ཡོངས་སུ་དག་པ་སྟེ།
en: Physical forms are pure owing to the purity of beings [and so forth], up to and including viewers; viewers [and so forth] are pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་མཐོང་བ་པོ་ཡོངས་སུ་དག་པ་དང་། གཟུགས་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of viewers [and so forth] and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །སེམས་ཅན་དང་མཐོང་བ་པོའི་བར་དུ་ཡོངས་སུ་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of beings [and so forth], up to and including viewers; viewers [and so forth] are pure owing to the purity of all-aspect omniscience [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པས། མཐོང་བ་པོ་ཡོངས་སུ་དག་པ་སྟེ། དེ་ལྟར་ན་མཐོང་བ་པོ་ཡོངས་སུ་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of viewers [and so forth] and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་འདོད་ཆགས་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ། གཟུགས་རྣམ་པར་དག་པས།
en: Moreover, Subhūti, physical forms are pure owing to the purity of desire, and desire is pure owing to the purity of physical forms.

source: འདོད་ཆགས་རྣམ་པར་དག་པ། དེ་ལྟར་ན་འདོད་ཆགས་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་ས་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of desire and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །འདོད་ཆགས་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of desire, and desire is pure owing to the purity of all-aspect omniscience [and so forth].

source: འདོད་ཆགས་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་འདོད་ཆགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of desire and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཞེ་སྡང་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ། གཟུགས་རྣམ་པར་དག་པས། ཞེ་སྡང་རྣམ་པར་དག་པ་སྟེ།
en: Physical forms are pure owing to the purity of hatred, and hatred is pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་ཞེ་སྡང་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of hatred and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །ཞེ་སྡང་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of hatred, and hatred is pure owing to the purity of all-aspect omniscience [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས། ཞེ་སྡང་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་ཞེ་སྡང་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of hatred and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །གཏི་མུག་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ། གཟུགས་རྣམ་པར་དག་པས། གཏི་མུག་རྣམ་པར་དག་པ་སྟེ།
en: Physical forms are pure owing to the purity of delusion, and delusion is pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་གཏི་མུག་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of delusion and this purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །གཏི་མུག་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of delusion, and delusion is pure owing to the purity of all-aspect omniscience [and so forth].

source: གཏི་མུག་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་གཏི་མུག་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མྱེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of delusion and this purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་འདོད་ཆགས་ཡོངས་སུ་དག་པས། གཟུགས་ཡོངས་སུ་དག་པ། གཟུགས་ཡོངས་སུ་དག་པས། འདོད་ཆགས་ཡོངས་སུ་དག་པ་སྟེ།
en: Moreover, Subhūti, physical forms are utterly pure owing to the utter purity of desire, and desire is utterly pure owing to the utter purity of physical forms.

source: དེ་ལྟར་ན་འདོད་ཆགས་ཡོངས་སུ་དག་པ་དང་། གཟུགས་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the utter purity of desire and this utter purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །འདོད་ཆགས་ཡོངས་སུ་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པས།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are utterly pure owing to the utter purity of desire, and desire is pure owing to the utter purity of all-aspect omniscience [and so forth].

source: འདོད་ཆགས་ཡོངས་སུ་དག་པ་སྟེ། དེ་ལྟར་ན་འདོད་ཆགས་ཡོངས་སུ་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the utter purity of desire and this utter purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཞེ་སྡང་ཡོངས་སུ་དག་པས། གཟུགས་ཡོངས་སུ་དག་པ། གཟུགས་ཡོངས་སུ་དག་པས། ཞེ་སྡང་ཡོངས་སུ་དག་པ་སྟེ།
en: Physical forms are utterly pure owing to the utter purity of hatred, and hatred is utterly pure owing to the utter purity of physical forms.

source: དེ་ལྟར་ན་ཞེ་སྡང་ཡོངས་སུ་དག་པ་དང་། གཟུགས་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the utter purity of hatred and this utter purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །ཞེ་སྡང་ཡོངས་སུ་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པས།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are utterly pure owing to the utter purity of hatred, and hatred is utterly pure owing to the utter purity of all-aspect omniscience [and so forth].

source: ཞེ་སྡང་ཡོངས་སུ་དག་པ་སྟེ། དེ་ལྟར་ན་ཞེ་སྡང་ཡོངས་སུ་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the utter purity of hatred and this utter purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “
